Revit 2027 API
ScheduleDefinition.ShowGrandTotalCount Property
 Indicates if the grand total row should display a count of elements in the schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowGrandTotalCount { get; set; }
Public Property ShowGrandTotalCount As Boolean
	Get
	Set
public:
property bool ShowGrandTotalCount {
	bool get ();
	void set (bool value);
}
member ShowGrandTotalCount : bool with get, set
Property Value
Boolean
 True if an element count should be displayed, false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: Display of a grand total row is not enabled.
Remarks
 ShowGrandTotalCount can only be enabled if ShowGrandTotal is enabled.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace